import numpy as np


class SAT_Const:
    """天文和数学常数定义类"""

    # 数学常数
    pi2 = 2 * np.pi  # 2π
    Rad = np.pi / 180  # 每度对应的弧度
    Deg = 180 / np.pi  # 每弧度对应的度
    Arcs = 3600 * 180 / np.pi  # 每弧度对应的角秒
    # 通用常数
    MJD_J2000 = 51544.5  # J2000历元的修正儒略日
    T_B1950 = -0.500002108  # B1950历元
    c_light = 299792458.0  # 光速 [m/s]; DE430
    AU = 149597870700.0  # 天文单位 [m]; DE430

    # 地球、太阳和月球的物理参数

    # 赤道半径和扁率
    R_Earth = 6378.137e3  # 地球半径 [m]; WGS-84
    f_Earth = 1 / 298.257223563  # 扁率; WGS-84
    R_Sun = 696000e3  # 太阳半径 [m]; DE430
    R_Moon = 1738e3  # 月球半径 [m]; DE430

    # 地球自转 (J2000时GMST的导数; 与惯性周期的差异由岁差引起)
    omega_Earth = 15.04106717866910 / 3600 * Rad  # [rad/s]; WGS-84

    # 引力系数
    GM_Earth = 398600.4418e9  # [m^3/s^2]; WGS-84
    GM_Sun = 132712440041.939400e9  # [m^3/s^2]; DE430
    GM_Moon = GM_Earth / 81.30056907419062  # [m^3/s^2]; DE430
    GM_Mercury = 22031.780000e9  # [m^3/s^2]; DE430
    GM_Venus = 324858.592000e9  # [m^3/s^2]; DE430
    GM_Mars = 42828.375214e9  # [m^3/s^2]; DE430
    GM_Jupiter = 126712764.800000e9  # [m^3/s^2]; DE430
    GM_Saturn = 37940585.200000e9  # [m^3/s^2]; DE430
    GM_Uranus = 5794548.600000e9  # [m^3/s^2]; DE430
    GM_Neptune = 6836527.100580e9  # [m^3/s^2]; DE430
    GM_Pluto = 977.0000009e9  # [m^3/s^2]; DE430

    # 1 AU处的太阳辐射压力
    P_Sol = 1367 / c_light  # [N/m^2] (1367 W/m^2); IERS 96